tests/load/websocket-load.yml
# tests/load/websocket-load.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Ramp up load"
  processor: "./websocket-processor.js"

scenarios:
  - name: "WebSocket Connection Test"
    engine: "socketio"
    flow:
      - emit:
          channel: "authenticate"
          data: "test-token"
      - think: 5
      - emit:
          channel: "subscribe-market"
          data: ["AAPL", "GOOGL", "MSFT"]
      - think: 30